/* eslint-disable react/no-unescaped-entities */
import React from 'react'

import Footer from 'Components/Blocks/Footer'

import { Background, Container, Wrapper } from './styles'

const Terms: React.FC = () => (
  <Background>
    <Container>
      <Wrapper>
        <h2>Договор-оферта</h2>
        <p>
          Договор-оферта на оказание услуг Общество с ограниченной
          ответственностью «Колибри», именуемый далее «Исполнитель» публикует
          настоящий Договор-оферту, далее «Оферта» или «Договор», представляющий
          собой публичную оферту по смыслу ст. 437 Гражданского кодекса
          Российской Федерации в отношении пользователей Сайта онлайн-школы
          «iDialogue» (https://idialogue.com), далее «Заказчик». Перед акцептом
          настоящего Договора-оферты просим Вас внимательно ознакомиться с
          изложенными ниже условиями пользования. Пользуясь услугами Сайта, Вы
          понимаете изложенные в настоящем Договоре условия и обязуетесь
          соблюдать их. Если Вы не согласны с какими-либо пунктами Договора,
          либо они Вам не ясны, то Вы обязаны отказаться от использования услуг
          Сайта. Пользование услугами Сайта без согласия с условиями настоящего
          Договора не допускается.
        </p>
        <p>
          Настоящий Договор-оферта вступает в силу с момента его акцепта
          Заказчиком.
        </p>
        <br />
        <h3>1. Термины и определения</h3>
        Для целей настоящего Договора используются следующие термины:
        <br />
        1.1. Акцепт - полное и безоговорочное принятие Заказчиком условий
        настоящего Договора путем внесения предоплаты за оказываемые услуги. В
        подтверждение заключения настоящего Договора и по ходу его исполнения
        Заказчику приходят информационные письма на электронную почту, указанную
        Заказчиком Исполнителю при регистрации на Сайте Исполнителя, с помощью
        оставления заявки в instagram, google-docs через сайт Исполнителя и/или
        заполнения формы пробного урока на сайте Исполнителя по адресу
        https://idialogue.info .
        <br />
        1.2. Договор-оферта – настоящий Договор, заключаемый Сторонами в
        офертно-акцептной форме без подписания отдельного письменного документа.
        <br />
        1.3. Заказчик – физическое или юридическое лицо, заказавшее и оплатившее
        Услуги в соответствии с настоящим Договором.
        <br />
        1.4. Курс – период оказания Исполнителем информационных услуг,
        включающий срок 1 (один) месяц, на который Заказчику совместно с
        Исполнителем были проставлены цели обучения.
        <br />
        1.5. Преподаватель – третье лицо, оказывающее Заказчику репетиторские
        услуги от имени Исполнителя. Оказание услуг Преподавателем представляет
        собой оказание услуг непосредственно самим Исполнителем. Любые действия
        Преподавателя по настоящему Договору представляют собой действия от
        имени Исполнителя.
        <br />
        1.6. Сайт – интернет сервис в сети интернет, расположенный по адресу
        https://idialogue.info , либо на поддоменах.
        <br />
        1.7. Стороны - Исполнитель и Заказчик совместно.
        <br />
        1.8. Услуги – оказываемые Исполнителем репетиторские Услуги по обучению
        Заказчика по направлению «Иностранные языки».
        <br />
        <br />
        <h3>2. Акцепт Договора-оферты</h3>
        2.1. Заказчик, имеющий намерение воспользоваться услугами, перед заказом
        услуг по Договору обязан акцептовать настоящий Договор-оферту.
        <br />
        2.2. Акцептом Договора-оферты признается внесение предоплаты за услуги
        на счет Исполнителя.
        <br />
        2.3. Не допускается акцепт настоящего Договора-оферты под условиями,
        либо с оговорками.
        <br />
        2.4. Акцепт настоящего Договора-оферты возможен при одновременном
        соблюдении следующих условий:
        <br />
        2.4.1. Внимательное прочтение Заказчиком всех условий настоящего
        Договора-оферты.
        <br />
        2.4.2. Согласие Заказчика соблюдать все условия настоящего
        Договора-оферты.
        <br />
        2.4.3. Ознакомление и согласие Заказчика со всеми условиями Политики
        конфиденциальности Сайта.
        <br />
        <br />
        <h3>3. Предмет договора</h3>
        3.1. В соответствии с настоящим Договором Исполнитель предоставляет
        Заказчику репетиторские Услуги по направлению «Иностранные языки».
        <br />
        3.2. Дополнительно к оказанию информационных услуг, Исполнитель вправе
        оказывать Заказчику дополнительные услуги. Дополнительные услуги могут
        быть как включены в общую стоимость услуг Исполнителя, так и оказываться
        за дополнительную плату. Актуальная информации об условиях оказания
        дополнительных услуг всегда размещена на Сайте Исполнителя.
        Дополнительные услуги включают в себя:
        <br />
        3.2.1. Оказание услуги по проведению онлайн экскурсий . Данная услуга
        включает в себя видео экскурсии с англоязычным гидом из разных локаций
        для целей повышения эффективности процесса оказания услуг Исполнителем
        для Заказчика. Длительность одной экскурсии составляет 60 (шестьдесят
        минут).
        <br />
        3.2.2. Оказание услуги Носителем иностранного языка. Услуга включает в
        себя проверку качества обучения и достижения согласованных Исполнителем
        и Заказчиком целей специалистом, для которого язык обучения является
        родным.
        <br />
        3.2.3. Разговорные чаты в мессенджерах.
        <br />
        3.2.4. Проведение вебинаров, конкурсов.
        <br />
        3.3. Исполнитель вправе в любой момент изменить перечень и условия
        оказания дополнительных услуг по своему усмотрению Актуальная информация
        о дополнительных услугах, их перечень, условия и порядок оказания всегда
        размещены на Сайте Исполнителя по адресу: https://idialogue.info
        <br />
        <br />
        <h3>4. Права и обязанности сторон</h3>
        4.1. Исполнитель обязуется:
        <br />
        4.1.1. В согласованные Сторонами сроки оказать Услуги Заказчику
        надлежащим образом в соответствии с условиями настоящего Договора.
        <br />
        4.1.2. Не разглашать конфиденциальную информацию и данные,
        предоставленные Заказчиком в связи с исполнением настоящего Договора, не
        раскрывать и не разглашать такие факты или такую информацию (кроме
        информации общедоступного характера) какой-либо третьей стороне без
        предварительного письменного согласия Заказчика, за исключением случаев,
        предусмотренных настоящий Договором.
        <br />
        4.2. Исполнитель вправе:
        <br />
        4.2.1. Оказать услуги лично, либо оказать услуги с помощью
        Преподавателей, оказывающими услуги от имени Исполнителя.
        <br />
        4.2.2. Требовать от Заказчика своевременной оплаты стоимости услуг в
        соответствии с условиями настоящего Договора.
        <br />
        4.2.3. Исполнитель вправе вести фиксацию аудио-видео-занятий с целью
        контроля качества обучения соответствующим подразделением школы.
        <br />
        4.2.4. Использовать электронный адрес, номер телефона и логин Skype,
        который использовался Заказчиком при регистрации, для отправки Заказчику
        информационных и рекламно-информационные материалов, направленных с
        целью информирования Заказчика о деятельности Исполнителя и ходе
        исполнения Договора. При отсутствии письменного или устного отказа
        Заказчика в получении данных материалов, направленного в адрес
        Исполнителя, согласие на получение данного рода материалов считается
        подтвержденным.
        <br />
        4.2.5. Отказать Заказчику в предоставлении и продлении услуг в случае
        высказывания Заказчиком в любой форме национальной, религиозной и другой
        нетерпимости или совершения иных действий, нарушающих действующее
        законодательство, а также принятые в общества правила и нормы поведения.
        <br />
        4.3. Заказчик обязуется:
        <br />
        4.3.1. Предоставить Исполнителю все сведения и данные, указанные в п.
        4.2.4 Договора, необходимые для выполнения своих обязательств по
        настоящему Договору.
        <br />
        4.3.2. Не разглашать конфиденциальную информацию и иные данные,
        предоставленные Исполнителем в связи с исполнением настоящего Договора,
        не раскрывать и не разглашать такие факты или информацию (кроме
        информации общедоступного характера) какой-либо третьей стороне без
        предварительного письменного согласия Исполнителя.
        <br />
        4.3.3. Каждый раз перед осуществлением нового заказа услуг Исполнителя
        посредством Сайта, проверять актуальную редакцию настоящего
        Договора-оферты.
        <br />
        4.3.4. Дать Исполнителю согласие на обработку своих персональных данных.
        <br />
        4.3.5. Сообщить Исполнителю обо всех обстоятельствах, которые могут
        создать препятствия в получении услуг.
        <br />
        4.4. Заказчик вправе:
        <br />
        4.4.1. Требовать от Исполнителя выполнения его обязательств по
        настоящему Договору и Приложениям к нему в срок и с надлежащим
        качеством. В случае проведения занятий Преподавателем занятие считается
        проведенным надлежащим образом, если в течение 1 (одного) часа с момента
        его проведения Заказчик не сообщит Исполнителю о том, что оно не
        состоялось по вине Преподавателя.
        <br />
        4.4.2. Сменить Преподавателя, для чего Заказчику необходимо сообщить об
        этом Исполнителю за 48 часов до начала занятия.
        <br />
        4.4.3. Отказаться от выполнения условий настоящего Договора в случае,
        если Исполнитель не приступил к исполнению обязательств по настоящему
        Договору.
        <br />
        <br />
        <h3>5. Порядок оказания услуг</h3>
        5.1. Для получения услуг Заказчик обязан оплатить услуги в соответствии
        с условиями настоящего Договора, предварительно выбрав Преподавателя или
        поручив Исполнителю выбрать для него Преподавателя.
        <br />
        5.2. Во всех случаях оказания услуг Исполнителем или Преподавателем,
        услуги считаются оказанными от имени Исполнителя.
        <br />
        5.3. Заказчику предоставляется бесплатное однократное пробное
        30-минутное занятие с целью определения предпочтений Заказчика по
        программе занятий (при отсутствии акций, указанных на сайте
        https://idialogue.info).
        <br />
        5.4. Одно занятие может длиться 45 минут, 60 минут или 90 минут, в
        зависимости от того, занятия какой продолжительности были оплачены
        Заказчиком.
        <br />
        5.5. Методика и формат занятий определяется непосредственно Исполнителем
        или Преподавателем с учетом пожеланий Заказчика.
        <br />
        5.6. Заказчик и Исполнитель согласовывают график занятий.
        <br />
        5.7. Услуги осуществляются по сети Интернет с применением таких программ
        как Zooom, Skype, Google docs и других.
        <br />
        5.8. Услуги могут быть оказаны Заказчику также в форме групповых занятий
        численностью не более 6 (шести) человек. Общие условия оказания услуг на
        групповом занятии совпадают с условиями оказания услуг на индивидуальных
        занятиях.
        <br />
        5.9. При оказании услуг в форме групповых занятий Заказчик обязуется не
        совершать действий, которые могут мешать другим участникам группы в
        получении услуг.
        <br />
        5.10. Заказчику может быть отказано в оказании услуг в составе группы в
        случае, если он не соответствует требованиям технического характера при
        проведении занятия.
        <br />
        5.11. В случае, если Заказчик не исполняет требования Исполнителя или
        Преподавателя, пропускает занятия или отстает от группы, Исполнитель или
        Преподаватель имеет право рекомендовать Заказчику взять дополнительно
        индивидуальные занятия или заниматься в другой группе.
        <br />
        5.12. Заказчик в рамках групповых занятий имеет право вернуть
        неиспользованные оплаченные занятия при условии, если предупредит о
        возврате не позднее, чем за 2 (две) недели до начала занятия, в
        противном случае денежные средства за последние 2 (две) недели до
        направления уведомления Заказчику не возвращаются.
        <br />
        <br />
        <h3>6. Стоимость услуг и порядок расчёта</h3>
        6.1. Стоимость оказываемых информационных услуг по обучению Заказчика по
        направлению «Иностранные языки» зависит от количества единовременно
        оплаченных занятий.
        <br />
        6.2. Стоимость и способы оплаты публикуются на странице на странице
        https://idialogue.info
        <br />
        6.3. Оплата Услуг осуществляется на основе предоплаты. Если у Заказчика
        не остаётся занятий, Заказчик обязан оплатить следующее занятие не
        позднее двадцати четырёх часов до начала следующего запланированного
        занятия. В случае неисполнения Заказчиком настоящей обязанности,
        Исполнитель вправе аннулировать график занятий Заказчика и ставить на
        ранее зарезервированное за Заказчика время занятия с другими лицами.
        <br />
        6.4. Исполнитель может в одностороннем порядке менять стоимость услуг на
        следующий (не оплаченный ранее) курс занятий, предварительно уведомив об
        этом Заказчика за 3 (три) дня до даты изменения стоимости услуг путём
        направления электронного сообщения по почте, Skype, телефонного звонка
        или телефонного сообщения по номеру телефона Заказчика.
        <br />
        6.5. Исполнитель вправе давать скидки, проводить акции, давать занятия в
        рассрочку по личной договоренности с Заказчиком и/или на условиях,
        которые будут публиковаться на сайте Исполнителя.
        <br />
        6.6. После оплаты Заказчиком услуг, Исполнитель направляет письмо по
        электронной почте, подтверждающее количество услуг и сумму, на которую
        услуги оказаны.
        <br />
        6.7. Комиссия за услуги интернет-эквайринга уже включена в сумму,
        указанную на сайте Исполнителя и оплачивается Заказчиком.
        <br />
        6.8. Заказчик самостоятельно несёт ответственность за правильность
        производимых им платежей.Заказчик обязуется самостоятельно ознакомиться
        и дать согласие с правилами работы платежных систем, посредством которых
        будет осуществляться оплата услуг Исполнителя. Исполнитель не несет
        ответственности за возможные сбои в работе платежных систем и возможные
        негативные последствия, которые могут наступить для Заказчика по вине
        платежных систем.
        <br />
        6.11. Заказчик самостоятельно оплачивает все услуги по организации
        связи, необходимой для потребления им Услуг Исполнителя.
        <br />
        6.12. Если по окончании оплаченных услуг Исполнитель в течение 5
        календарных дней не направляет претензию Исполнителю по почтовому
        адресу, указанному в настоящем Договоре, услуги считаются оказанными в
        полном объёме.
        <br />
        6.13. Моментом оплаты считается поступление денежных средств на
        расчётный счёт Исполнителя либо поступления денежных средств
        непосредственно Исполнителю в случае оплаты оказываемых услуг иным
        способом, оговоренным Сторонами. Исполнитель вправе отказать Заказчику в
        получении услуг в случае, если на момент начала занятий услуги
        Исполнителя не оплачены, в том числе если оплата не была проведена по
        вине платежных систем.
        <br />
        <br />
        <h3>7. Неявка на занятие, отмена занятий и опоздание на занятие</h3>
        7.1. Если в установленное время Заказчик не доступен для звонка
        Исполнителя, занятие считается проведенным и оплачивается в размере
        100%.
        <br />
        7.2. Если в установленное время Исполнитель или Преподаватель не
        доступен для звонка Заказчика, занятие не считается проведённым, кроме
        того, Исполнитель или Преподаватель проводит одно дополнительное
        бесплатное занятие.
        <br />
        7.3. Если Заказчик предупреждает об отмене занятия менее, чем за 24
        часа, независимо от причины отмены, занятие оплачивается в размере 100%.
        <br />
        7.4. Если Исполнитель или Преподаватель предупреждает об отмене занятия
        менее, чем за сутки, независимо от причины отмены, занятие не считается
        проведённым, кроме того, Исполнитель или Преподаватель проводит одно
        дополнительное бесплатное занятие.
        <br />
        7.5. Если Заказчик опаздывает на занятие, занятие не продлевается, при
        этом Преподаватель использует оставшееся время для оказания услуги
        Заказчику.
        <br />
        7.6. Исполнитель и Преподаватель не отвечают за неоказание услуги в
        связи с отсутствием у Заказчика необходимого программного обеспечения
        или технических проблем с интернетом.
        <br />
        <br />
        <h3>8. Приостановка оказания Услуг. Отказ от Договора</h3>
        8.1. В случае, если настоящий Договор расторгается по желанию Заказчика,
        он должен предоставить Исполнителю письменный мотивированный отказ от
        услуг Исполнителя, отправив его по почтовому адресу Исполнителя,
        указанному в настоящем Договоре, приложив копию своего паспорта.
        <br />
        8.2. В качестве реквизитов для возврата денежных средств, Заказчиком
        может быть указано: номер карты, выпущенной на территории стран СНГ
        (кроме карт банка City Bank); БИК, номер банковского счета и ФИО
        держателя счета для счета, открытого на территории РФ; аккаунт PayPal
        или другие реквизиты по требованию Исполнителя.
        <br />
        8.3. В случае расторжения Договора по совместной инициативе или
        инициативе одной из сторон, срок возврата денежных средств составляет до
        10 календарных дней.
        <br />
        8.4. В случае, если Заказчик прервал занятия без предварительного
        согласования с Исполнителем на срок более 90 дней, Исполнитель вправе
        признать оговоренные услуги оказанными в полном объеме и принятыми
        Заказчиком. При этом Исполнитель вправе аннулировать график занятий
        Заказчика и ставить на ранее зарезервированное на Заказчика время
        занятия с другими лицами.
        <br />
        <br />
        <h3>9. Гарантии качества услуг</h3>
        9.1. Исполнитель гарантирует Заказчику овладение определёнными языковыми
        навыками и компетенциями по прохождении 1 месяца получения услуг (курса)
        при соблюдении всех нижеперечисленных условий:
        <br />
        9.1.1. Языковые навыки были заранее оговорены между Заказчиком и
        Исполнителем на срок 1 месяц, зафиксированы письменно или по e-mail
        переписке между Заказчиком и Исполнителем.
        <br />
        9.1.2. Заказчик точно следовал всем рекомендациям Исполнителя по
        достижению результата, которые включают себя обязательное полное
        выполнение домашних заданий и другие. Выполнение и невыполнение домашних
        заданий может фиксироваться Исполнителем в личном кабинете Заказчика.
        Также учитывается личная переписка между Заказчиком и Исполнителем по
        e-mail, Skype и другим электронным средствам связи.
        <br />
        9.1.3. Все оплаченные занятия пройдены в намеченный срок без отмен,
        пропусков и опозданий.
        <br />
        9.2. В случае несоблюдения Заказчиком условий п.9.1 сроки обладания
        языковыми навыками пересматриваются Исполнителем.
        <br />
        9.3. Заказчик имеет право вернуть 100% оплаченных средств, если
        оговоренный между ним и Исполнителем результат обучения не будет
        достигнут. Порядок возврата предусмотрен разделом 8 настоящего договора.
        <br />
        9.4. Исполнитель имеет право не возвращать средства, если не выполнены
        условия п. 9.1 настоящего Договора.
        <br />
        9.5. Возврат денежных средств выполняется за курс, то есть за срок
        обучения не более 3 месяцев.
        <br />
        9.6. В случае разногласий между Заказчиком и Исполнителем или
        Преподавателем, касающихся владения Заказчиком оговорённых языковых
        навыков и компетенций, Исполнитель обязан созвать комиссию, в состав
        которой входит не менее 3 экспертов, имеющих профессиональную
        квалификацию по соответствующему предмету и стаж работы в сфере
        образования не менее 5 лет. Выводы комиссии являются основанием для
        возврата средств или отказа в таком возврате.
        <br />
        9.7. Возможные дальнейшие споры решаются в соответствии с п.16
        настоящего договора.
        <br />
        <br />
        <h3>10. Интеллектуальная собственность</h3>
        10.1. Заказчик признает, что Сайт, его интерфейс и содержание (включая,
        но не ограничиваясь элементами дизайна, текстом, графическими
        изображениями, иллюстрациями, видео, скриптами, программами, музыкой,
        звуками и другими объектами и их подборками, связанными с Сайтом)
        защищены авторским правом, товарными знаками и иными правами, которые
        принадлежат Исполнителю или иным законным правообладателям.
        <br />
        10.2. Заказчик не вправе воспроизводить, копировать, изменять,
        уничтожать, перерабатывать (включая выполнение любого перевода или
        локализации), продавать, сдавать в прокат, опубликовывать, скачивать,
        иным образом распространять Сайт либо его компоненты, декомпилировать
        или иным образом пытаться извлечь исходный код компонентов Сайта,
        являющихся программным обеспечением, а также изменять функционал Сайта
        без предварительного письменного согласия Исполнителя.
        <br />
        10.3. Заказчик не вправе удалять и/или изменять какую-либо информацию,
        размещенную Исполнителем в рамках Сайта, в том числе знаки охраны
        авторского права и средств индивидуализации.
        <br />
        10.4. Если иное явным образом не установлено в настоящем Договоре, ничто
        в настоящем Договоре не может быть рассмотрено как передача
        исключительных прав на Сайт и/или его компоненты Заказчику.
        <br />
        <br />
        <h3>11. Правовое регулирование</h3>
        11.1. Отношения Сторон по настоящему Договору регулируются действующим
        законодательством российской Федерации независимо от места нахождения
        каждой из Сторон.
        <br />
        11.2. Настоящий Договор является Договором оказания услуг по смыслу
        Гражданского кодекса и к нему применяются соответствующие положения
        законодательства.
        <br />
        <br />
        <h3>12. Документооборот</h3>
        12.1. Электронный документооборот между Сторонами по настоящему Договору
        имеет юридическую силу равную юридической силе обычного письменного
        документооборота.
        <br />
        12.2. Стороны пришли к соглашению о том, что электронный документооборот
        применяется ими в отношении любых запросов, согласований, комментариев,
        иных сообщений Сторон, а также в отношении любых документов, включая
        письма, уведомления, претензии, акты об оказании услуг, дополнительные
        соглашения и т.д.
        <br />
        12.3. Электронный документооборот имеет юридическую силу исключительно
        при условии, что обмен сообщениями или документами осуществляется
        Сторонами посредством адресов электронной почты или иных каналов связи,
        прямо предусмотренных настоящим Договором, либо дополнительными
        соглашениями к нему.
        <br />
        12.4. Документы могут быть направлены в электронном виде Сторонами в
        следующих формах:
        <br />
        6.4.1 В форме электронного документа, то есть документа, созданного в
        электронной форме без предварительного документирования на бумажном
        носителе, подписанного электронной подписью в соответствии с
        законодательством Российской Федерации.
        <br />
        6.4.2 В форме электронного образа документа(электронной копии документа,
        изготовленного на бумажном носителе), то есть документа,переведенного в
        электронную форму с помощью средств сканирования копии документа,
        изготовленного на бумажном носителе.
        <br />
        12.5. В случае поступления сообщений, документов по каналам связи, не
        предусмотренным настоящим Договором, либо дополнительными соглашениями к
        нему, Сторона, получившая такие сообщения или документы вправе их
        игнорировать, в этом случае сообщение, либо документ считаются
        недоставленными и не полученными Стороной.
        <br />
        12.6. Каждая из Сторон самостоятельно несет ответственность за
        ограничение круга лиц, которые имеют доступ к электронным каналам связи,
        предусмотренным настоящим Договором. В случае утраты доступа к
        электронному каналу связи, Сторона обязана немедленно известить об этом
        другую Сторону и несет ответственность в случае отсутствия такого
        извещения.
        <br />
        12.7. Документы, отправленные по электронному каналу связи одной
        Стороной, считаются полученными другой Стороной в день их фактического
        получения, а сроки, течение которых зависит от времени получения
        документа Стороной, начинают исчисляться со следующего дня.
        <br />
        12.8. Электронные сообщения и документы, в соответствии с настоящим
        Договором, в полной мере могут быть использованы для подтверждения
        заключенных и совершенных сделок, правоотношений Сторон, в том числе
        могут быть использованы в качестве доказательств в правоохранительных
        органах, третейском суде, судебных органах, при рассмотрении споров по
        гражданско-правовым сделкам и т.п., а также подтверждают их
        действительность и юридическую силу.
        <br />
        <br />
        <h3>13. Ответственность</h3>
        13.1. За ненадлежащее исполнение, либо неисполнение обязательств,
        предусмотренных настоящим Договором, Стороны несут ответственность в
        соответствии с действующим законодательством и настоящим Договором.
        <br />
        13.2. Исполнитель не несет ответственности за неисполнение своих
        обязательств по настоящему Договору, если такое неисполнение обусловлено
        действиями самого Заказчика.
        <br />
        13.3. Исполнитель не несет ответственности в случае невозможности
        оказания услуг, либо задержки сроков оказания услуг по причине сбоев в
        программном обеспечении, сервисах, поисковых системах, сайтах и т.п.,
        принадлежащих третьим лицам, за действия которых Исполнитель не
        отвечает.
        <br />
        13.4. Заказчик понимает и соглашается с тем, что в случае неисполнения
        им со своей Стороны своих обязательств по Договору, результат оказания
        услуг может не соответствовать его ожиданиям.
        <br />
        <br />
        <h3>14. Обстоятельства непреодолимой силы</h3>
        14.1. Стороны не несут ответственности за полное или частичное
        невыполнение обязательств по настоящему Договору, обусловленное
        обстоятельствами непреодолимой силы, возникшими помимо воли Сторон и
        которые нельзя предвидеть или предотвратить, а именно: землетрясение,
        наводнение, прочие стихийные бедствия, война, гражданская война,
        блокада, эмбарго, забастовка, принятие органами государственной власти
        актов, препятствующих исполнению договора.
        <br />
        <br />
        <h3>15. Порядок изменения и расторжения договора</h3>
        15.1. Настоящий Договор-оферта может быть в любое время изменен
        Исполнителем в одностороннем порядке.
        <br />
        <br />
        <h3>16. Решение спорных вопросов</h3>
        16.1. Все возникшие между Сторонами споры разрешаются путем переговоров.
        <br />
        16.2. Исполнитель вправе выступать арбитром при разрешении спора,
        возникшего между Заказчиком и Преподавателем при оказании услуг в рамках
        настоящего Договора.
        <br />
        16.3. Стороны пришли к соглашению, что претензионный (досудебный)
        порядок урегулирования споров, возникших в результате исполнения
        настоящего Договора, является для них обязательным.
        <br />
        16.4. Претензии по настоящему Договору могут быть направлены Сторонами
        по электронной почте.
        <br />
        16.5. Стороны договорились, что срок ответа на претензию составляет не
        более 10 рабочих дней.
        <br />
        16.6. В случае возникновения судебного спора, дело подлежит рассмотрению
        в суде в соответствии с действующим законодательством.
        <br />
        <br />
        <h3>17. Прочие условия</h3>
        17.1. Стороны согласовали, что во всем ином, что не предусмотрено
        настоящим договором, будут применяться нормы действующего
        законодательства.
        <br />
        17.2. Стороны пришли к соглашению, что любая информация о
        взаимоотношениях Сторон по настоящему Договору является
        конфиденциальной.
        <br />
        17.3. Настоящий договор содержит весь объем соглашений между сторонами в
        отношении предмета настоящего договора, которые отменяют и делают
        недействительными все другие обязательства или представления, которые
        могли быть приняты или сделаны сторонами в устной или письменной форме
        до заключения настоящего договора.
        <br />
        <br />
        <h3>18. Реквизиты Исполнителя</h3>
        Общество с ограниченной ответственностью «Колибри»
        <br />
        Онлайн-обучение английскому языку.
        <br />
        Телефон: +7 495 411 32 58
        <br />
        Адрес: Москва, 123182 Авиационная ул, 79-1-134
        <br />
        Сайт: https://idialogue.com
        <br />
        ИНН: 7734669013
        <br />
        ОГРН: 1117746955281
        <br />
        Р/с: 40702810210000360332
        <br />
        БИК: 044525974
        <br />
        АО "ТИНЬКОФФ БАНК" г. МОСКВА
        <br />
        к/с: 30101810145250000974
      </Wrapper>
    </Container>

    <Footer />
  </Background>
)

export default Terms
