import React from 'react'

import Footer from 'Components/Blocks/Footer'

import { Background, Container, Wrapper } from './styles'

const Privacy: React.FC = () => (
  <Background>
    <Container>
      <Wrapper>
        <h2>Политика конфиденциальности iDialogue</h2>
        <h3>Политика конфиденциальности iDialogue 1.</h3>
        Общие положения 1.1.
        <br />
        ООО «Колибри», ОГРН 1117746955281, ИНН 7734669013, (далее –
        «Администрация) публикует настоящую Политику конфиденциальности в
        отношении пользователей (далее – «Пользователь») Сайта idialogue.info,
        далее «Сайт».
        <br />
        1.2. Настоящая Политика конфиденциальности содержит информацию о том,
        как собирается, используется и раскрывается персональная информация о
        Пользователях Сайта.
        <br />
        1.3. Перед использованием Сайта просим Вас внимательно ознакомиться с
        изложенными ниже условиями использования персональной информации.
        Пользуясь Сайтом, Вы понимаете изложенные в настоящей Политике
        конфиденциальности условия и подтверждаете свое согласие с ними.
        <br />
        1.4. Если Вы не согласны с какими-либо пунктами Политики
        конфиденциальности, то Вы обязаны отказаться от использования Сайта.
        Использование Сайта без согласия с условиями настоящей Политики
        конфиденциальности не допускается.
        <br />
        1.5. При использовании Сайта Пользователь дает свое безусловное согласие
        с обработкой его персональной информации, перечисленной в настоящей
        Политике.
        <br />
        1.6. Если Вам не ясны какие-либо пункты Политики конфиденциальности, Вы
        обязаны предварительно обратиться к Администрации за разъяснениями и
        только после получения разъяснений использовать Сайт.
        <br />
        <br />
        <h3>2. Общая информация</h3>
        2.1. Администрация обрабатывает персональную информацию Пользователей в
        полном соответствии с Федеральным законом Российской̆ Федерации от
        27.07.2006 г. N152-ФЗ «О персональных данных».
        <br />
        2.2. Администрация вправе осуществлять следующие действия с персональной
        информацией Пользователя: сбор, запись, систематизация, накопление,
        хранение, уточнение (обновление, изменение), извлечение, использование,
        передача (распространение, предоставление, доступ), обезличивание,
        блокирование, удаление и уничтожение.
        <br />
        2.3. Администрация обрабатывает персональные данные автоматизированным и
        неавтоматизированным способами, с использованием средств вычислительной
        техники и без использования таких средств.
        <br />
        <br />
        <h3>3. Перечень используемой персональной информации</h3>
        3.1. При использовании Сайта Пользователь предоставляет персональную
        информацию, включающую в себя персональную информацию личного характера
        (персональные данные) и персональную информацию, автоматически
        получаемую при доступе к Сайту.
        <br />
        3.2. Персональная информация личного характера, которую обрабатывает
        Администрация:
        <br />
        3.2.1. Имя;
        <br />
        3.2.2. Адрес электронной почты;
        <br />
        3.2.3. Номер контактного телефона;
        <br />
        3.2.4. Администрация вправе обрабатывать любые иные персональные данные
        Пользователя в случае, если соответствующие данные были переданы
        Пользователем Администрации при использовании Сайта и/или при дальнейшем
        взаимодействии Сторон. Предоставление Пользователем любой дополнительной
        информации Администрации означает одновременно дачу согласия
        Пользователем на обработку такой персональной информации.
        <br />
        3.3. Администрация вправе обрабатывать как все персональные данные
        Пользователя, так и часть из них по своему усмотрению и в зависимости от
        того, какая информация будет предоставлена Пользователем Администрации.
        <br />
        3.4. Персональная информация, которая автоматически собирается Сайтом:
        <br />
        3.4.1. Данные о технических средствах (устройствах), технологическом
        взаимодействии с Сайтом (в т.ч. IP-адрес хоста, вид операционной системы
        пользователя, тип браузера, географическое положение, поставщик услуг
        Интернета).
        <br />
        3.4.2. Время посещения Сайта и последующие действия Пользователя на
        Сайте.
        <br />
        3.4.3. Информация, автоматически получаемая с помощью технологии
        cookies.
        <br />
        <br />
        <h3>
          4. Действие Политики конфиденциальности в отношении несовершеннолетних
        </h3>
        4.1. Использование Сайта допускается исключительно лицами, достигшими
        возраста 18 лет. Иное может быть согласовано Сторонами дополнительно
        исключительно при предварительном уведомлении Пользователем
        Администрации и при условии предоставления письменного согласия законных
        представителей несовершеннолетнего.
        <br />
        4.2. Передавая Администрации свои персональные данные, Пользователь
        подтверждает, что он достиг возраста 18 лет, если иное не было
        согласовано Сторонами дополнительно.
        <br />
        4.3. Администрация во всех случаях не собирает и не использует
        персональную информацию о детях, не достигших возраста 14 лет.
        <br />
        <br />
        <h3>5. Цели использования персональной информации</h3>
        5.1. Администрация использует персональную информацию Пользователей
        только для строго определенных целей, в частности указанные цели
        включают в себя:
        <br />
        5.1.1. Предоставление Пользователю возможности использовать Сайт.
        <br />
        5.1.2. Информирование Пользователя о возможностях, связанных с
        использованием Сайта и о предоставляемых Администрацией услугах.
        <br />
        5.1.3. Поддержание обратной связи между Администрацией и Пользователем.
        <br />
        5.1.4. Направление Пользователю предложений рекламного и коммерческого
        характера. Пользователь дает свое согласие с получением указанной
        информации от Администрации.
        <br />
        5.1.5. Ведение переговоров между Администрацией и Пользователем.
        <br />
        5.1.6. Заключение и исполнение договоров между Администрацией и
        Пользователем, исполнение иных обязательств Сторон.
        <br />
        5.1.7. Анализ статистики использования Сайта Пользователями.
        <br />
        5.1.8. Улучшение Сайта.
        <br />
        <br />
        <h3>6. Принципы использования персональной информации</h3>
        6.1. Администрация при использовании персональной информации о
        Пользователях обязуется придерживаться следующих основных принципов
        использования персональной информации:
        <br />
        6.1.1. Законность, справедливость и прозрачность. Персональные данные
        обрабатываются законно, справедливо и прозрачно. Любая информация о
        целях, методах и объемах обработки персональной информации излагается
        максимально доступно и просто.
        <br />
        6.1.2. Ограничение цели. Данные собираются и используются исключительно
        в тех целях, которые заявлены в настоящей Политике.
        <br />
        6.1.3. Минимизация данных. Администрация не собирает персональную
        информацию в большем объеме, чем это необходимо для целей, указанных в
        настоящей Политике.
        <br />
        6.1.4. Точность. Персональная информация, которая является неточной
        удаляется либо подлежит исправлению по требованию Пользователя.
        <br />
        6.1.5. Ограничение хранения. Персональная информация хранится сроком не
        более, чем это необходимо для целей обработки.
        <br />
        6.1.6. Целостность и конфиденциальность. При обработке данных
        Пользователей Администрация обеспечивает защиту персональных данных от
        несанкционированной или незаконной обработки, уничтожения и повреждения.
        <br />
        <br />
        <h3> 7. Права Пользователя</h3>
        7.1. Пользователь имеет право:
        <br />
        7.1.1. на получение информации об обработке персональных данных,
        относящихся к данному Пользователю.
        <br />
        7.1.2. на уточнение, блокирование или уничтожение его персональных
        данных в случае, если они являются неполными, устаревшими, неточными,
        незаконно полученными или не являются необходимыми для заявленной цели
        обработки;
        <br />
        7.1.3. на отзыв данного им согласия на обработку персональных данных;
        <br />
        7.1.4. на защиту своих прав и законных интересов, в том числе на
        возмещение убытков и компенсацию морального вреда в судебном порядке;
        <br />
        7.1.5. на обжалование действий или бездействия Администрации в
        уполномоченный орган по защите прав субъектов персональных данных или в
        судебном порядке.
        <br />
        7.1.6. Иные права, предусмотренные Федеральным законом Российской̆
        Федерации от 27.07.2006 г. N152-ФЗ «О персональных данных».
        <br />
        <br />
        <h3>8. Соблюдение прав Пользователя по стандартам GDPR</h3>
        8.1. Пользователь в соответствии со стандартами Общего регламента по
        защите данных Европейского союза (GDPR)вправе в любой момент запросить у
        Администрации подтверждение факта обработки его данных, место и цель
        обработки, категории обрабатываемых персональных данных, каким третьим
        лицам персональные данные раскрываются, период, в течение которого
        данные будут обрабатываться, а также уточнить источник получения
        Администрацией персональной информации и требовать ее исправления.
        <br />
        8.2. Пользователь в соответствии со стандартами Общего регламента по
        защите данных (GDPR)вправе в любой момент воспользоваться правом на
        забвение, подразумевающим удаление персональной информации Пользователя
        по его запросу,в этом случае при прекращении обработки персональной
        информации Пользователя Администрация не сможет предоставить
        Пользователю возможность использовать Сервис.
        <br />
        8.3. Пользователь в соответствии со стандартами Общего регламента по
        защите данных (GDPR)вправе воспользоваться правом на переносимость
        данных, а именно потребовать от Администрации предоставить бесплатно
        электронную копию персональной информации другой компании.
        <br />
        <br />
        <h3>9. Защита персональной информации</h3>
        9.1. Администрация гарантирует, что она не будет разглашать, либо
        передавать третьим лицам персональную информацию о Пользователе, за
        исключением случаев, прямо предусмотренных действующим законодательством
        и настоящей Политикой.
        <br />
        9.2. Администрация обязуется предпринимать все необходимые
        организационные и технические меры для защиты персональной информации о
        Пользователеот неправомерного или случайного доступа третьих лиц,
        уничтожения, изменения, блокирования, копирования, распространения, а
        также иных неправомерных действий третьих лиц.
        <br />
        9.3. Администрация применяет комплекс правовых, организационных и
        технических мер по обеспечению безопасности персональных данных для
        обеспечения конфиденциальности персональных данных и их защиты от
        неправомерных действий, а именно:
        <br />
        9.3.1. обеспечивает неограниченный доступ к Политике конфиденциальности,
        копия которой размещена на Сайте Администрации;
        <br />
        9.3.2. утверждает и приводит в действие «Положение о коммерческой тайне
        и обработке персональных данных» и иные внутренние локальные акты;
        <br />
        9.3.3. производит ознакомление работников с положениями законодательства
        о персональных данных, а также с настоящей Политикой и Положением о
        коммерческой тайне и обработке персональных данных;
        <br />
        9.3.4. осуществляет допуск работников к персональным данным,
        обрабатываемым в информационной системе Администрации, а также к их
        материальным носителям только для выполнения трудовых обязанностей;
        <br />
        9.3.5. применяет организационные и технические меры и использует
        средства защиты информации, необходимые для достижения установленного
        уровня защищенности персональных данных;
        <br />
        9.3.6. осуществляет обнаружение фактов несанкционированного доступа к
        персональным данным и принимает меры по реагированию, включая
        восстановление персональных данных, модифицированных или уничтоженных
        вследствие несанкционированного доступа к ним;
        <br />
        9.3.7. осуществляет внутренний контроль соответствия обработки
        персональных данных требованиям 152-ФЗ, принятыми в соответствии с ним
        иным нормативными правовыми актами, требованиям к защите персональных
        данных, Политике и иным локальным актам, включающим контроль за
        принимаемыми мерами по обеспечению безопасности персональных данных и их
        уровня защищенности при обработке в информационной системе
        Администрации.
        <br />
        <br />
        <h3>10. Предоставление персональной информации третьим лицам</h3>
        10.1. Администрация не занимается продажей, либо обменом персональных
        данных своих Пользователей.
        <br />
        10.2. Пользователь понимает, что использование персональной информации
        Администрацией может включать в себя использование персональной
        информации сотрудниками Администрации, а также партнерами и
        контрагентами Администрации, которые помогают Администрации в управлении
        Сайтом.
        <br />
        10.3. Администрация вправе предоставлять персональную информацию о
        Пользователях третьим лицам в случае, если это необходимо для выполнения
        условий Договоров или иных соглашений, стороной которых является
        Пользователь.
        <br />
        10.4. Пользователь понимает, что Администрация может предоставлять
        третьим лицам обобщенную статистику о Пользователях Сайта для целей
        проведения статистического анализа, повышения эффективности работы
        Сайта.
        <br />
        <br />
        <h3>11. Изменение Политики конфиденциальности</h3>
        11.1. Администрация оставляет за собой право в любой момент внести
        изменения в любой из пунктов Политики конфиденциальности, не допуская
        при этом включение в Политику положений, противоречащих действующему
        законодательству.
        <br />
        11.2. При внесении изменений в актуальной редакции указывается дата
        последнего обновления. Новая редакция Политики вступает в силу с момента
        ее размещения, если иное не предусмотрено редакцией Политики.
        <br />
        11.3. Пользователи обязаны регулярно отслеживать изменения в настоящей
        Политике конфиденциальности на предмет возможных изменений.
        <br />
        <br />
        <h3>12. Поддержка Пользователей</h3>
        12.1. Пользователь вправе в любой момент обратиться к Администрации с
        вопросами относительно положений настоящей Политики конфиденциальности
        посредством направления запроса контактным данным, указанным на Сайте.
        При направлении обращения Пользователь обязан максимально подробно
        описать возникший вопрос, либо проблему, а по запросу Администрации
        предоставить дополнительные данные.
      </Wrapper>
    </Container>

    <Footer />
  </Background>
)

export default Privacy
